{
  "title": "Building Mechanics",
  "description": "The core of Carbrix is its intuitive building system. Players can snap together various parts, including chassis, wheels, engines, and custom components, to create unique vehicles. The system allows for complex designs and encourages experimentation with different configurations.",
  "content": "[INFO]\nThe core of Carbrix is its intuitive building system. Players can snap together various parts, including chassis, wheels, engines, and custom components, to create unique vehicles. The system allows for complex designs and encourages experimentation with different configurations.\n[/INFO]\n\n## Creative Construction\n\nCarbrix offers a (highlight-blue)modular building system(/highlight) that empowers players to design and construct a vast array of vehicles. Whether you're aiming for a realistic car, a soaring plane, a nimble bike, or a completely whimsical contraption, the possibilities are endless.\n\n### Key Features:\n\n*   (fa)wrench() **Snap-together Parts:** Easily combine chassis, wheels, engines, and other components.\n*   (fa)puzzle-piece() **Custom Component Integration:** Design and incorporate your own unique parts.\n*   (fa)flask() **Experimentation Encouraged:** Test different configurations and see how they perform under realistic physics.\n*   (fa)save() **Save and Load Designs:** Save your creations and spawn them again anytime for quick access.\n\n## The Build Menu\n\nAccessing the build menu is simple and can be done (KBD)anytime(/KBD) during gameplay. This allows for on-the-fly modifications, repairs, or complete overhauls of your vehicle.\n\n[DETAILS title=\"Build Menu Features\"]\n*   **Stop, Fix, and Go!:** Seamlessly transition between building and playing.\n*   **Intuitive Interface:** Easy to navigate and select parts.\n*   **Real-time Feedback:** See how your changes affect the vehicle's physics and performance instantly.\n[/DETAILS]\n\n## Building in Action\n\n[GALLERY]\n![Building Screenshot 1](assets/BUILDING.png)\n![Building Screenshot 2](assets/logic.png)\n[/GALLERY]\n\n## Tips for Builders\n\n*   Start with a stable chassis and build outwards.\n*   Experiment with different wheel types for varied terrain.\n*   Pay attention to weight distribution for better handling.\n*   Utilize the physics logic to create advanced mechanisms.\n"
}
