{
  "fullTitle": "Carbrix Challenge Mode",
  "lastEdited": "12 August 2025",
  "content": "[INFO]\nTest your engineering skills and creativity in Carbrix's Challenge Mode.\n[/INFO]\n\n## What is Challenge Mode?\n\nChallenge Mode is a series of curated levels designed to test your building and driving skills. Each level presents a unique objective, from simple deliveries to complex obstacle courses. Can you build the perfect vehicle to overcome the challenge?\n\n## 20+ Levels of Fun\n\n[INFO]\nProgress through a variety of increasingly difficult challenges.\n[/INFO]\n\n*   (fa)flag() **Beginner Levels**: Learn the basics of vehicle building with simple, straightforward challenges.\n*   (fa)mountain() **Intermediate Levels**: Face more complex obstacles that require creative thinking and advanced building techniques.\n*   (fa)rocket() **Expert Levels**: Tackle the most difficult challenges that will push your engineering skills to the limit.\n\n## Types of Challenges\n\n[GRID cols=\"2\"]\n[CELL]\n### (fa)delivery() Delivery Missions\nTransport cargo from point A to point B. Sounds easy, but the terrain is rough and your vehicle needs to be tough!\n[/CELL]\n[CELL]\n### (fa)flag-checkered() Racing Challenges\nRace against the clock or other players to reach the finish line first. Speed and stability are key!\n[/CELL]\n[CELL]\n### (fa)arrows-up-down() Obstacle Courses\nNavigate through complex mazes, jump across gaps, and avoid hazards. Precision control is a must.\n[/CELL]\n[CELL]\n### (fa)star() Collection Quests\nGather scattered items across the map. You'll need a vehicle that can handle rough terrain and carry lots of cargo.\n[/CELL]\n[/GRID]\n\n## Rewards and Unlockables\n\n[INFO]\nComplete challenges to earn rewards and unlock new content for Sandbox mode.\n[/INFO]\n\n*   (fa)gift() **New Parts**: Unlock unique vehicle parts, engines, and wheels that aren't available in Sandbox mode.\n*   (fa)blueprint() **Blueprints**: Get pre-made blueprints for vehicles that are perfectly suited for specific challenges.\n*   (fa)palette() **Customization Options**: Unlock new colors, decals, and visual customization options for your vehicles.\n*   (fa)trophy() **Achievements**: Earn Steam Achievements for completing difficult challenges and reaching milestones.\n\n## Tips for Success\n\n[INFO]\nHere are some tips to help you conquer the challenges.\n[/INFO]\n\n*   (fa)lightbulb() **Read the Objective Carefully**: Make sure you understand what you need to do before you start building.\n*   (fa)balance-scale() **Balance Speed and Stability**: A fast vehicle is useless if it can't handle the terrain.\n*   (fa)recycle() **Don't Be Afraid to Scrap**: If your first design doesn't work, don't be afraid to start over. Sometimes a completely new approach is needed.\n*   (fa)users() **Learn from Others**: Check the Steam Workshop for blueprints and tips from other players who have completed the same challenges.\n"
}
