{
  "fullTitle": "Carbrix Features",
  "lastEdited": "12 August 2025",
  "content": "[INFO]\nDiscover the exciting features that make Carbrix a unique and engaging sandbox vehicle building game.\n[/INFO]\n\n## Core Gameplay\n\n[GRID cols=\"2\"]\n[CELL]\n### (fa)wrench() Intuitive Building System\nSnap together various parts, including chassis, wheels, engines, and custom components, to create unique vehicles. The system allows for complex designs and encourages experimentation with different configurations.\n[/CELL]\n[CELL]\n### (fa)flask() Realistic Physics\nExperience a world driven by realistic physics. Every vehicle you build will behave differently based on its design, weight, and the parts you use.\n[/CELL]\n[CELL]\n### (fa)save() Save and Load\nSave your creations and spawn them again anytime. The build menu is accessible anytime, allowing you to stop, fix, and go!\n[/CELL]\n[CELL]\n### (fa)map-marked-alt() Exploration\nExplore a dynamic, open environment. Test your vehicles on various terrains and discover new possibilities.\n[/CELL]\n[/GRID]\n\n## Sandbox Mode\n\n[INFO]\nUnleash your creativity in Carbrix's Super fun SandBox mode.\n[/INFO]\n\nIn SandBox mode, you have access to all the blocks in the game with endless possibilities. Make whatever you have been thinking, dreaming or wondering about! Play on a flatmap and do mini Quests!\n\nWith SandBox what Can't you do?\n\n## Challenge Mode\n\n[INFO]\nTest your engineering skills with a variety of challenges.\n[/INFO]\n\n*   (fa)flag() **20+ Levels**: Progress through a series of increasingly difficult challenges.\n*   (fa)trophy() **Objectives**: Complete specific tasks, from simple deliveries to complex obstacle courses.\n*   (fa)star() **Rewards**: Unlock new parts and blueprints for use in Sandbox mode.\n\n## Multiplayer & Community\n\n[INFO]\nConnect with other players and share your creations.\n[/INFO]\n\n*   (fa)share-nodes() **Workshop Support**: Share and download vehicles, blueprints, and custom maps.\n*   (fa)users() **Family Sharing**: Share your game with family members.\n*   (fa)cloud() **Cloud Saves**: Your saved vehicles and progress are stored in the cloud.\n\n## Visuals & Audio\n\n[INFO]\nImmerse yourself in the world of Carbrix with polished visuals and a dynamic soundscape.\n[/INFO]\n\n*   (fa)image() **First-Person Perspective**: Experience the world from the driver's seat.\n*   (fa)volume-up() **Dynamic Soundtrack**: Music and sound effects that react to your actions.\n*   (fa)palette() **Customization**: Personalize your vehicles with a variety of colors and parts.\n"
}
