{
  "fullTitle": "Carbrix Multiplayer & Community",
  "lastEdited": "12 August 2025",
  "content": "[INFO]\nConnect with other players and share your creations in the Carbrix community.\n[/INFO]\n\n## Steam Workshop\n\n[INFO]\nShare your vehicles, blueprints, and custom maps with the world.\n[/INFO]\n\nThe Steam Workshop is a powerful tool for community-driven content creation:\n\n*   (fa)upload() **Share Your Creations**: Upload your favorite vehicles and blueprints for others to download and enjoy.\n*   (fa)download() **Download New Content**: Browse and download vehicles, maps, and other creations from the community.\n*   (fa)thumbs-up() **Rate and Comment**: Give feedback on other people's creations and see what the community is loving.\n*   (fa)star() **Curated Collections**: Find the best builds in curated collections made by the community and developers.\n\n## Community Features\n\n[INFO]\nEngage with other players and stay up-to-date with the latest Carbrix news.\n[/INFO]\n\n[GRID cols=\"2\"]\n[CELL]\n### (fa)users() Family Sharing\nShare your game with family members and friends. Perfect for co-op building sessions or showing off your latest creation.\n[/CELL]\n[CELL]\n### (fa)cloud() Cloud Saves\nYour saved vehicles and progress are stored in the cloud. Access your creations from any computer, anywhere.\n[/CELL]\n[/GRID]\n\n## Social Hub\n\n[INFO]\nFind your tribe and connect with fellow Carbrix enthusiasts.\n[/INFO]\n\n*   (fa)discord() **Official Discord Server**: Join the official Discord to chat with the developers, share screenshots, and participate in community events.\n*   (fa)reddit() **Reddit Community**: Discuss the game, share tips, and get help on the official Carbrix subreddit.\n*   (fa)twitter() **Twitter**: Follow @Redston4D for the latest updates, sneak peeks, and community spotlights.\n\n## Future Multiplayer Plans\n\n[INFO]\nThe development team has exciting plans for the future of multiplayer in Carbrix.\n[/INFO]\n\n[DETAILS title=\"What's Coming?\"]\n*   (fa)gamepad() **Co-op Building**: Work together with friends to build massive, complex vehicles.\n*   (fa)flag() **Competitive Challenges**: Race your creations against other players in custom-built tracks.\n*   (fa)globe() **Shared Worlds**: Explore a shared sandbox world where you can interact with other players' creations.\n*   (fa)trophy() **Leaderboards**: Compete for the top spot in various challenge leaderboards.\n[/DETAILS]\n"
}
