{
  "title": "Development Timeline",
  "description": "A chronological look at the development of Carbrix, from its initial concept to its upcoming Steam launch.",
  "content": "[INFO]\nA chronological look at the development of Carbrix, from its initial concept to its upcoming Steam launch.\n[/INFO]\n\n## Development Journey\n\n[TIMELINE]\n[EVENT date=\"March 2024\"]\n### Initial Concept & Prototype\nThe first public mention and early access release of Carbrix on itch.io. The core concept of a sandbox physics-based vehicle building game was established.\n[/EVENT]\n[EVENT date=\"13 August 2024\"]\n### Version 3.9.0 Release\nA major update was released, introducing new challenge levels and significantly expanding the sandbox features, giving players more freedom and content.\n[/EVENT]\n[EVENT date=\"22 August 2024\"]\n### Version 3.9.1 Release\nThis update focused on performance improvements and introduced new vehicle parts, enhancing the building and gameplay experience.\n[/EVENT]\n[EVENT date=\"7 September 2024\"]\n### Version 3.9.2 Release\nThe latest public release on itch.io, which included various bug fixes and minor enhancements to stabilize and improve the game.\n[/EVENT]\n[EVENT date=\"10 August 2025\"]\n### SteamDB Metadata Update\nThe last recorded update on SteamDB, indicating ongoing preparation and active development for the upcoming Steam launch.\n[/EVENT]\n[EVENT date=\"TBD\"]\n### Steam Playtest Access\nExpected to open for more participants, allowing the community to test the game and provide feedback before the official release.\n[/EVENT]\n[EVENT date=\"TBD\"]\n### Steam Official Launch\nThe anticipated full official release of Carbrix on Steam, bringing all the features and improvements to a wider audience.\n[/EVENT]\n[/TIMELINE]\n\n## Future Roadmap\n\n[INFO]\nThe development team has a clear vision for the future of Carbrix, focusing on community engagement and feature expansion.\n[/INFO]\n\n[COLUMNS]\n[COLUMN]\n### Short-Term Goals\n*   Continue development and regular updates on itch.io.\n*   Refine existing features based on player feedback.\n*   Expand the library of available vehicle parts.\n*   Introduce new challenge modes and objectives.\n[/COLUMN]\n[COLUMN]\n### Long-Term Vision\n*   Successful official launch on Steam with full platform features.\n*   Foster a strong community through workshops and playtests.\n*   Explore new game modes and content based on player feedback.\n*   Potentially introduce multiplayer and sharing features.\n[/COLUMN]\n[/COLUMNS]\n"
}
